EDT/ZUP/zup_edt/src/InformationRegisters/ВредныеФакторыПозицииШтатногоРасписания/ВредныеФакторыПозицииШтатногоРасписания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ВредныеФакторыПозицииШтатногоРасписания</name>
  <dimensions>
    <name>Позиция</name>
    <type>
      <types>CatalogRef.ШтатноеРасписание</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВредныйФактор</name>
    <type>
      <types>CatalogRef.ВредныеОпасныеПроизводственныеФакторы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/ZUP/zup_edt/src/InformationRegisters/ВредныеФакторыПозицииШтатногоРасписания/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	СохранитьПрежнийНаборЗаписей();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ, Замещение)

	Если ЗарплатаКадры.ОтключитьБизнесЛогикуПриЗаписи(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	МедицинскиеОсмотры.ОбновитьПериодичностьОсмотровПозицийПоНаборуВредныхФакторовВидовРабот(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СохранитьПрежнийНаборЗаписей()
	
	Если Отбор["Позиция"].Использование = Ложь Или Не ЗначениеЗаполнено(Отбор.Позиция.Значение) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Позиция", Отбор.Позиция.Значение);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДанныеНабора.Позиция КАК Позиция,
		|	ДанныеНабора.ВредныйФактор КАК ВредныйФактор
		|ИЗ
		|	РегистрСведений.ВредныеФакторыПозицииШтатногоРасписания КАК ДанныеНабора
		|ГДЕ
		|	ДанныеНабора.Позиция = &Позиция";
	
	ДополнительныеСвойства.Вставить("ПрежнийНабор", Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
